eraseme.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <ns1:subscibeProductResponse xmlns:ns1="http://www.csapi.org/schema/parlayx/subscribeproduct/v1_0/local">
            <ns1:resultCode>7999</ns1:resultCode>
        </ns1:subscibeProductResponse>
    </soapenv:Body>
</soapenv:Envelope>


         for request


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header>
    <wsse:Security xmlns:tns="http://www.huawei.com.cn/schema/common/v2_1"
                   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                   xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <wsse:UsernameToken>
            <wsse:Username>PA00001605</wsse:Username>
            <wsse:Password>QapUNQIhoWr6h5nC+xP04HNINFU=</wsse:Password>
            <wsse:Nonce>NjZjMDc0YzItNzEwZC00MGEyLThiNjgtZTQ5YWQ0YmE1MmNl</wsse:Nonce>
            <wsu:Created>2018-03-14T19:49:01Z</wsu:Created>
        </wsse:UsernameToken>
    </wsse:Security>
    <tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com.cn/schema/common/v2_1"
                           xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                           xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <tns:AppId>AMXAPPSCLUBEPE</tns:AppId>
        <tns:TransId>2018031419490188850</tns:TransId>
        <tns:OA>tel:51929472524</tns:OA>
    </tns:RequestSOAPHeader>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
    <loc:subscibeProduct xmlns:loc="http://www.csapi.org/schema/parlayx/subscribeproduct/v1_0/local"
                         xmlns:ns3="http://www.csapi.org/schema/parlayx/subscribeproduct/v1_0"
                         xmlns:ns5="http://www.csapi.org/schema/parlayx/common/v2_1">
        <loc:version>5.0</loc:version>
        <loc:userID>
            <ID>51929472524</ID>
            <type>0</type>
        </loc:userID>
        <loc:subInfo>
            <productID>MDSP2000011153</productID>
        </loc:subInfo>
        <loc:channelID>99</loc:channelID>
    </loc:subscibeProduct>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>